fast_finish_2026/LR7/webapp/runs/smoke-shockfluid-20260913/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15760;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       15800;
    }
    axis
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          200;
        startFace       15840;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       16040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          16000;
        startFace       16240;
    }
)

// ************************************************************************* //
